# На вход программе подается строка текста. Напишите программу, которая заменяет все вхождения цифры 1 на слово «one».

string = input()

print(string.replace('1', 'one'))