# На вход программе подается строка текста.
# Напишите программу, использующую списочное выражение, которая выводит все цифровые символы данной строки.

print(''.join([digit for digit in input() if digit.isdigit()]))